Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: \D a non-digit
ru_ru: \D нецифра non-digit

source: \S non-whitespace character
ru_ru: \S непробельный символ

source: \W a non-word character
ru_ru: \W несловесный символ

source: \d a digit (0-9)
ru_ru: \d цифра (0-9)

source: \s a whitespace character (space, tab, newline,
ru_ru: \s пробелы (пробел, табуляция, новая строка,

source: \w a word character (a-z, A-Z, 0-9, _)
ru_ru: \w символ слова (a-z, A-Z, 0-9, _)

source: ^ start of string
ru_ru: ^ начало строки

source: a 256 Set ${^UTF8CACHE} to -1, to run the UTF-8 caching
ru_ru: a 256 Установите ${^UTF8CACHE} в -1, для запуска UTF-8 кэширования

source: a single character
ru_ru: один символ

source: a2p - Awk to Perl translator
ru_ru: a2p - преобразование кода Awk в Perl

source: adjacent)
ru_ru: смежный)

source: allows Perl to do unsafe operations.
ru_ru: позволяет Perl делать небезопасные операции.

source: and quoting on non-Unix systems X<hashbang> X<#!>
ru_ru: и ссылка на не-Unix системах X<hashbang> X<#!>

source: and under Win32, the approximately equivalent:
ru_ru: и под Win32, приблизительно эквивалентны:

source: as the first line in C<*.cmd> file (B<-S> due to a bug in cmd.exe's `extproc' handling).
ru_ru: в качестве первой линии в C<*.cmd> файле (B<-S> в связи с ошибкой в ​​cmd.exe по регуляции `extproc').

source: at the top of your program, where B<-mysw> are any command line switches you want to pass to Perl.
ru_ru: в верхней части вашей программы, где B<-mysw> любые параметры командной строки, которые вы хотите передать Perl.

source: behaves just like B<-e>, except that it implicitly enables all optional features (in the main compilation unit).
ru_ru: ведет себя так же, как B<-e>, за исключением того, что она неявно включает все дополнительные функции (в основном блоке компиляции, например say).

source: causes Perl to assume the following loop around your program, which makes it iterate over filename arguments somewhat like I<sed -n> or I<awk>:
ru_ru: вызывает Perl предположить следующий цикл вокруг вашей программы, который перебирает аргументы файлы также, как I<sed -n> или I<awk> :

source: causes Perl to assume the following loop around your program, which makes it iterate over filename arguments somewhat like I<sed>:
ru_ru: заставляет Perl сделать следующий цикл вокруг вашей программы, что делает перебор аргументов файла в некоторой части, как в I<sed>:

source: causes Perl to check the syntax of the program and then exit without executing it.
ru_ru: вызывает Perl для проверки синтаксиса программы и последующего выхода без выполнения.

source: causes a2p to assume that input will always have that many fields.
ru_ru: вызов a2p предполагает, что входящие данные будут всегда содержать много полей.

source: character (eg "3 4 5 ")
ru_ru: символ (например "3 4 5 ")

source: code in debugging mode.
ru_ru: код в режиме отладки.

source: compression-vars: zcat='' zip='zip' are here !
ru_ru: сжатые-переменные: zcat='' zip='zip' уже здесь !

source: continue { print; # this prints to original filename
ru_ru: continue { print; # здесь напечатается исходное имя файла

source: decreasing precedence) -- if the variables indicate
ru_ru: убывания приоритета) - если переменные указывают

source: enables automatic line-ending processing.
ru_ru: обеспечивает автоматическое завершения строк обработки.

source: enables rudimentary switch parsing for switches on the command line after the program name but before any filename arguments (or before an argument of B<-->).
ru_ru: позволяет рудиментарной разбора переключателем для переключателей в командной строке после имени программы, но до любого аргумента файла (или перед аргументом B<-->).

source: eq equality
ru_ru: eq равенство

source: except that the B<-i> form doesn't need to compare $ARGV to $oldargv to know when the filename has changed.
ru_ru: исключением того, что форму B<-i> не нужно сравнивать $ARGV в $oldargv чтобы знать, когда файл был изменен.

source: ge greater than or equal
ru_ru: ge больше или равно

source: gt greater than
ru_ru: gt больше

source: http://www.cpan.org/ the Comprehensive Perl Archive
ru_ru: http://www.cpan.org/ the Comprehensive Perl Archive (Всеобъемлющий Perl Архив)

source: http://www.perl.com/ Perl articles (O'Reilly)
ru_ru: http://www.perl.com/ статьи Perl (O'Reilly)

source: http://www.perl.org/ the Perl homepage
ru_ru: http://www.perl.org/ домашняя страница Perl

source: i 8 UTF-8 is the default PerlIO layer for input streams
ru_ru: i 8 UTF-8 представляет собой слой умолчанию PerlIO для потоков ввода

source: if ( condition ) {
ru_ru: if ( условие ) {

source: if ($a =~ /foo/) { ... } # true if $a contains "foo"
ru_ru: if ($a =~ /foo/) { ... } # верно если $a содержит "foo"

source: if (/foo/) { ... } # true if $_ contains "foo"
ru_ru: if (/foo/) { ... } # верно если $_ содержит "foo"

source: in UTF-8
ru_ru: в UTF-8

source: is equivalent to
ru_ru: эквивалентна

source: is the same as using the program:
ru_ru: так же, как с помощью программы:

source: it is almost always possible to rewrite such code to be more efficient by discarding the semantic sugar.
ru_ru: почти всегда можно переписать такой код, чтобы быть более эффективным путем отбрасывания семантического сахара.

source: le less than or equal
ru_ru: le меньше или равно

source: letter is a (eg "abacadaf")
ru_ru: письма (например, "abacadaf")

source: like BEGIN
ru_ru: like НАЧАЛО

source: logger("We have a logger subroutine!");
ru_ru: logger("У нас есть регистратор подпрограммы!");

source: lt less than
ru_ru: lt меньше

source: makes Perl use the PATH environment variable to search for the program unless the name of the program contains path separators.
ru_ru: Perl позволяет использовать переменную окружения PATH для поиска программы, если имя программы не содержит разделителей пути.

source: may be used to enter one line of program.
ru_ru: может быть использован для ввода одной строки программы.

source: my $logmessage = $_[0]; # uncommon, and ugly
ru_ru: my $logmessage = $_[0]; # редко, и уродливо

source: my ($l, $r) = @_; # Pass 1 to check up one call level from here
ru_ru: my ($l, $r) = @_; # передать 1, чтобы отметить один вызов уровня отсюда

source: my ($logmessage, $priority) = @_; # common
ru_ru: my ($logmessage, $priority) = @_; # общие

source: ne inequality
ru_ru: ne неравенство

source: not
ru_ru: отрицание

source: o 16 UTF-8 is the default PerlIO layer for output streams
ru_ru: o 16 UTF-8 представляет собой слой PerlIO умолчанию для потоков вывода

source: old awk considers I<extra_args> to be arguments to C<sprintf>; new awk considers them arguments to C<print>.
ru_ru: Старый awk считает I<extra_args> будут аргументы C<sprintf>; новый awk считает их аргументами C<print>.

source: or if you just want to be running at least version, place a statement like this at the top of your program:
ru_ru: или если вы просто хотите запустить на минимальной версии, разместить подобное заявление в верхней части вашей программы:

source: perl Perl overview (this section)
ru_ru: perl Perl обзор (этот раздел)

source: perl The perl compiler/interpreter
ru_ru: perl The perl компилятор/интерпретатор

source: perl - The Perl 5 language interpreter
ru_ru: perl - интерпретатор языка Perl5

source: perl script ...
ru_ru: Perl скрипт ...

source: perl5004delta Perl changes in version 5.004
ru_ru: perl5004delta Perl изменения в версии 5.004

source: perl5005delta Perl changes in version 5.005
ru_ru: perl5005delta Perl изменения в версии 5.005

source: perl5100delta Perl changes in version 5.10.0
ru_ru: perl5100delta Perl изменения в версии 5.10.0

source: perl5101delta Perl changes in version 5.10.1
ru_ru: perl5101delta Perl изменения в версии 5.10.1

source: perl5120delta Perl changes in version 5.12.0
ru_ru: perl5120delta Perl изменения в версии 5.12.0

source: perl5121delta Perl changes in version 5.12.1
ru_ru: perl5121delta Perl изменения в версии 5.12.1

source: perl5122delta Perl changes in version 5.12.2
ru_ru: perl5122delta Perl изменения в версии 5.12.2

source: perl5123delta Perl changes in version 5.12.3
ru_ru: perl5123delta Perl изменения в версии 5.12.3

source: perl5124delta Perl changes in version 5.12.4
ru_ru: perl5124delta Perl изменения в версии 5.12.4

source: perl5125delta Perl changes in version 5.12.5
ru_ru: perl5125delta Perl изменения в версии 5.12.5

source: perl5140delta Perl changes in version 5.14.0
ru_ru: perl5140delta Perl изменения в версии 5.14.0

source: perl5141delta Perl changes in version 5.14.1
ru_ru: perl5141delta Perl изменения в версии 5.14.1

source: perl5142delta Perl changes in version 5.14.2
ru_ru: perl5142delta Perl изменения в версии 5.14.2

source: perl5143delta Perl changes in version 5.14.3
ru_ru: perl5143delta Perl изменения в версии 5.14.3

source: perl5144delta Perl changes in version 5.14.4
ru_ru: perl5144delta Perl изменения в версии 5.14.4

source: perl5160delta Perl changes in version 5.16.0
ru_ru: perl5160delta Perl изменения в версии 5.16.0

source: perl5161delta Perl changes in version 5.16.1
ru_ru: perl5161delta Perl изменения в версии 5.16.1

source: perl5162delta Perl changes in version 5.16.2
ru_ru: perl5162delta Perl изменения в версии 5.16.2

source: perl5163delta Perl changes in version 5.16.3
ru_ru: perl5163delta Perl изменения в версии 5.16.3

source: perl5180delta Perl changes in version 5.18.0
ru_ru: perl5180delta Perl изменения в версии 5.18.0

source: perl561delta Perl changes in version 5.6.1
ru_ru: perl561delta Perl изменения в версии 5.6.1

source: perl56delta Perl changes in version 5.6
ru_ru: perl56delta Perl изменения в версии 5.6

source: perl581delta Perl changes in version 5.8.1
ru_ru: perl581delta Perl изменения в версии 5.8.1

source: perl582delta Perl changes in version 5.8.2
ru_ru: perl582delta Perl изменения в версии 5.8.2

source: perl583delta Perl changes in version 5.8.3
ru_ru: perl583delta Perl изменения в версии 5.8.3

source: perl584delta Perl changes in version 5.8.4
ru_ru: perl584delta Perl изменения в версии 5.8.4

source: perl585delta Perl changes in version 5.8.5
ru_ru: perl585delta Perl изменения в версии 5.8.5

source: perl586delta Perl changes in version 5.8.6
ru_ru: perl586delta Perl изменения в версии 5.8.6

source: perl587delta Perl changes in version 5.8.7
ru_ru: perl587delta Perl изменения в версии 5.8.7

source: perl588delta Perl changes in version 5.8.8
ru_ru: perl588delta Perl изменения в версии 5.8.8

source: perl589delta Perl changes in version 5.8.9
ru_ru: perl589delta Perl изменения в версии 5.8.9

source: perl58delta Perl changes in version 5.8.0
ru_ru: perl58delta Perl изменения в версии 5.8.0

source: perlaix Perl notes for AIX
ru_ru: perlaix Perl заметки для AIX

source: perlamiga Perl notes for AmigaOS
ru_ru: perlamiga Perl заметки для AmigaOS

source: perlapi Perl API listing (autogenerated)
ru_ru: perlapi Perl API объявления (автоматически сгенерированные)

source: perlapio Perl internal IO abstraction interface
ru_ru: perlapio Perl внутренний интерфейс ввода-вывода абстрактный интерфейс

source: perlartistic Perl Artistic License
ru_ru: perlartistic Perl Лицензия Художников (Artistic License)

source: perlbook Perl book information
ru_ru: perlbook Perl информация о книгах

source: perlbook - Books about and related to Perl
ru_ru: perlbook - Информация о книгах по Perl

source: perlbs2000 Perl notes for POSIX-BC BS2000
ru_ru: perlbs2000 Perl заметки для POSIX-BC BS2000

source: perlcall Perl calling conventions from C
ru_ru: perlcall Perl соглашения о вызове из C

source: perlce Perl notes for WinCE
ru_ru: perlce Perl заметки для WinCE

source: perlcheat Perl cheat sheet
ru_ru: perlcheat Perl шпаргалка

source: perlclib Internal replacements for standard C library functions
ru_ru: perlclib Внутренние замены для стандартных библиотечных функций C

source: perlcn Perl for Simplified Chinese (in EUC-CN)
ru_ru: perlcn Perl для упрощенного китайского (в EUC-CN)

source: perlcommunity Perl community information
ru_ru: perlcommunity Информация о Perl сообществе

source: perlcygwin Perl notes for Cygwin
ru_ru: perlcygwin Perl заметки для Cygwin

source: perldata Perl data structures
ru_ru: perldata Структуры данных Perl

source: perldbmfilter Perl DBM filters
ru_ru: perldbmfilter Perl DBM фильтры

source: perldebguts Perl debugging guts and tips
ru_ru: perldebguts Perl внутренности отладки и советы

source: perldebtut Perl debugging tutorial
ru_ru: perldebtut Perl Учебник отладки

source: perldebug Perl debugging
ru_ru: perldebug Perl отладка

source: perldelta Perl changes since previous version
ru_ru: perldelta Perl изменения с предыдущей версии

source: perldgux Perl notes for DG/UX
ru_ru: perldgux Perl заметки для DG/UX

source: perldiag Perl diagnostic messages
ru_ru: perldiag Perl диагностические сообщения

source: perldoc Look up Perl documentation in Pod format
ru_ru: perldoc Посмотрите Perl документацию в формате Pod

source: perldoc - Look up Perl documentation in Pod format.
ru_ru: perldoc - Perl-документация в POD-формате.

source: perldoc -L fr -q FAQ Keyword
ru_ru: perldoc -L ru -q FAQ КлючевоеСлово

source: perldoc -L it -f BuiltinFunction
ru_ru: perldoc -L it -f ВстроеннаяФункция

source: perldoc -q FAQ Keyword
ru_ru: perldoc -q FAQ КлючевоеСлово

source: perldoc -v PerlVariable
ru_ru: perldoc -v ПеременнаяPerl

source: perldos Perl notes for DOS
ru_ru: perldos Perl заметки для DOS

source: perldsc Perl data structures intro
ru_ru: perldsc Perl введение в структуры данных

source: perldtrace Perl's support for DTrace
ru_ru: perldtrace Perl поддержка для DTrace

source: perlebcdic Considerations for running Perl on EBCDIC platforms
ru_ru: perlebcdic Соображения для запуска Perl на EBCDIC платформах

source: perlembed Perl ways to embed perl in your C or C++ application
ru_ru: perlembed Perl пути для встраивания perl в ваши C или C++ приложения

source: perlexperiment A listing of experimental features in Perl
ru_ru: perlexperiment Cписок экспериментальных функций в Perl

source: perlfaq Perl frequently asked questions
ru_ru: perlfaq Perl часто задаваемые вопросы

source: perlfaq1 General Questions About Perl
ru_ru: perlfaq1 Общие вопросы о Perl

source: perlfaq2 Obtaining and Learning about Perl
ru_ru: perlfaq2 Получение и изучение Perl

source: perlfaq3 Programming Tools
ru_ru: perlfaq3 Инструменты программирования

source: perlfaq4 Data Manipulation
ru_ru: perlfaq4 Манипуляция данными

source: perlfaq5 Files and Formats
ru_ru: perlfaq5 Файлы и форматы

source: perlfaq6 Regexes
ru_ru: perlfaq6 Регулярные выражения

source: perlfaq7 Perl Language Issues
ru_ru: perlfaq7 Проблемы языка Perl

source: perlfaq8 System Interaction
ru_ru: perlfaq8 Взаимодействие с системой

source: perlfaq9 Networking
ru_ru: perlfaq9 Сети

source: perlfilter Perl source filters
ru_ru: perlfilter Perl исходные файлы

source: perlfork Perl fork() information
ru_ru: perlfork Perl fork() информация

source: perlform Perl formats
ru_ru: perlform Perl форматы

source: perlfreebsd Perl notes for FreeBSD
ru_ru: perlfreebsd Perl заметки для FreeBSD

source: perlfunc Perl built-in functions
ru_ru: perlfunc Perl встроенные функции

source: perlgit Using git with the Perl repository
ru_ru: perlgit Использование Git с Perl репозиторием

source: perlglossary Perl Glossary
ru_ru: perlglossary Perl Глоссарий

source: perlgpl GNU General Public License
ru_ru: perlgpl Универсальная Общественная Лицензия GNU

source: perlguts Perl internal functions for those doing extensions
ru_ru: perlguts Perl внутренние функции для тех, кто делает расширения

source: perlhack Perl hackers guide
ru_ru: perlhack Руководство хакера Perl

source: perlhacktips Tips for Perl core C code hacking
ru_ru: perlhacktips Советы как хачить(взламывать) код ядра Perl на С

source: perlhacktut Walk through the creation of a simple C code patch
ru_ru: perlhacktut Прогулка по созданию простого патча кода на C

source: perlhaiku Perl notes for Haiku
ru_ru: perlhaiku Perl заметки для Haiku

source: perlhist Perl history records
ru_ru: perlhist Записи истории Perl

source: perlhpux Perl notes for HP-UX
ru_ru: perlhpux Perl заметки для HP-UX

source: perlhurd Perl notes for Hurd
ru_ru: perlhurd Perl заметки для Hurd

source: perlintern Perl internal functions (autogenerated)
ru_ru: perlintern Perl внутренние функции (автоматически сгенерированные)

source: perlinterp Overview of the Perl interpreter source and how it works
ru_ru: perlinterp Обзор исходного кода интерпретатора Perl и как он работает

source: perlintro Perl introduction for beginners
ru_ru: perlintro Введение в Perl для начинающих

source: perlintro -- a brief introduction and overview of Perl
ru_ru: perlintro -- краткое введение и обзор Perl

source: perliol C API for Perl's implementation of IO in Layers
ru_ru: perliol C API для Perl реализации ввода-вывода в слоях

source: perlipc Perl interprocess communication
ru_ru: perlipc Perl межпроцессное взаимодействие

source: perlirix Perl notes for Irix
ru_ru: perlirix Perl заметки для Irix

source: perljp Perl for Japanese (in EUC-JP)
ru_ru: perljp Perl для японского (в EUC-JP)

source: perlko Perl for Korean (in EUC-KR)
ru_ru: perlko Perl для корейского (в EUC-KR)

source: perllexwarn Perl warnings and their control
ru_ru: perllexwarn Perl предупреждения и управление ими

source: perllinux Perl notes for Linux
ru_ru: perllinux Perl заметки для Linux

source: perllocale Perl locale support
ru_ru: perllocale Perl языковая поддержка

source: perllol Perl data structures: arrays of arrays
ru_ru: perllol Структуры данных Perl: массивы массивов

source: perlmacos Perl notes for Mac OS (Classic)
ru_ru: perlmacos Perl заметки для Mac OS (Classic)

source: perlmacosx Perl notes for Mac OS X
ru_ru: perlmacosx Perl заметки для Mac OS X

source: perlmod Perl modules: how they work
ru_ru: perlmod Perl модули: как они работают

source: perlmodinstall Perl modules: how to install from CPAN
ru_ru: perlmodinstall Perl модули: как установить из CPAN

source: perlmodlib Perl modules: how to write and use
ru_ru: perlmodlib Perl модули: как писать и использовать

source: perlmodstyle Perl modules: how to write modules with style
ru_ru: perlmodstyle Perl модули: правильный стиль написания модулей

source: perlmroapi Perl method resolution plugin interface
ru_ru: perlmroapi Perl метод резолюции интерфейса плагинов

source: perlnetware Perl notes for NetWare
ru_ru: perlnetware Perl заметки для NetWare

source: perlnewmod Perl modules: preparing a new module for distribution
ru_ru: perlnewmod Perl модули: подготовка нового модуля для опубликования

source: perlnumber Perl number semantics
ru_ru: perlnumber Perl семантики числа

source: perlobj Perl objects
ru_ru: perlobj Perl объекты

source: perlootut Perl OO tutorial for beginners
ru_ru: perlootut Perl OO учебник для начинающих

source: perlop Perl operators and precedence
ru_ru: perlop Perl операторы и их приоритет

source: perlopenbsd Perl notes for OpenBSD
ru_ru: perlopenbsd Perl заметки для OpenBSD

source: perlopentut Perl open() tutorial
ru_ru: perlopentut Perl open() учебник

source: perlos2 Perl notes for OS/2
ru_ru: perlos2 Perl заметки для OS/2

source: perlos390 Perl notes for OS/390
ru_ru: perlos390 Perl заметки для OS/390

source: perlos400 Perl notes for OS/400
ru_ru: perlos400 Perl заметки для OS/400

source: perlpacktut Perl pack() and unpack() tutorial
ru_ru: perlpacktut Perl pack() и unpack() учебник

source: perlperf Perl Performance and Optimization Techniques
ru_ru: perlperf Perl Производительность и Методы оптимизации

source: perlplan9 Perl notes for Plan 9
ru_ru: perlplan9 Perl заметки для Plan 9

source: perlpod Perl plain old documentation
ru_ru: perlpod Perl простая старая документация

source: perlpodspec Perl plain old documentation format specification
ru_ru: perlpodspec Perl простая старая документация спецификация формата

source: perlpodstyle Perl POD style guide
ru_ru: perlpodstyle Perl POD руководство по стилю

source: perlpolicy Perl development policies
ru_ru: perlpolicy Perl политики(установки) разработки

source: perlport Perl portability guide
ru_ru: perlport Perl руководство по переносимости

source: perlpragma Perl modules: writing a user pragma
ru_ru: perlpragma Perl модули: написание пользовательской pragma (директивы компилятору)

source: perlpragma - how to write a user pragma
ru_ru: perlpragma - как писать пользовательские прагмы

source: perlqnx Perl notes for QNX
ru_ru: perlqnx Perl заметки для QNX

source: perlre Perl regular expressions, the rest of the story
ru_ru: perlre Perl регулярные выражения, остальная часть истории

source: perlreapi Perl regular expression plugin interface
ru_ru: perlreapi Perl регулярные выражения интерфейс плагина

source: perlrebackslash Perl regular expression backslash sequences
ru_ru: perlrebackslash Perl регулярные выражения последовательности с обратным слэшем

source: perlrecharclass Perl regular expression character classes
ru_ru: perlrecharclass Perl регулярные выражения классы символов

source: perlref Perl references, the rest of the story
ru_ru: perlref Perl ссылки, остальная часть истории

source: perlreftut Perl references short introduction
ru_ru: perlreftut Perl краткое введение в ссылки

source: perlreguts Perl regular expression engine internals
ru_ru: perlreguts Perl регулярные внутренние внутренности движка

source: perlrequick Perl regular expressions quick start
ru_ru: perlrequick Регулярные выражения Perl быстрый старт

source: perlreref Perl regular expressions quick reference
ru_ru: perlreref Perl регулярные выражения краткий справочник

source: perlretut Perl regular expressions tutorial
ru_ru: perlretut Perl регулярные выражения учебник

source: perlriscos Perl notes for RISC OS
ru_ru: perlriscos Perl заметки для RISC OS

source: perlrun Perl execution and options
ru_ru: perlrun Выполнение программы на Perl и его опции

source: perlrun - how to execute the Perl interpreter
ru_ru: perlrun - как запустить интерпретатор Perl

source: perlsec Perl security
ru_ru: perlsec Perl безопасность

source: perlsolaris Perl notes for Solaris
ru_ru: perlsolaris Perl заметки для Solaris

source: perlsource Guide to the Perl source tree
ru_ru: perlsource Руководство по дереву исходного кода Perl

source: perlstyle Perl style guide
ru_ru: perlstyle Perl руководство по стилю программирования

source: perlsub Perl subroutines
ru_ru: perlsub Perl подпрограммы

source: perlsymbian Perl notes for Symbian
ru_ru: perlsymbian Perl заметки для Symbian

source: perlsyn Perl syntax
ru_ru: perlsyn Синтаксис Perl

source: perlthrtut Perl threads tutorial
ru_ru: perlthrtut Perl потоки учебник

source: perltie Perl objects hidden behind simple variables
ru_ru: perltie Perl объекты скрытые за простыми переменными

source: perltoc Perl documentation table of contents
ru_ru: perltoc Perl документация Оглавление

source: perltrap Perl traps for the unwary
ru_ru: perltrap Perl ловушки для неосторожных

source: perltru64 Perl notes for Tru64
ru_ru: perltru64 Perl заметки для Tru64

source: perltw Perl for Traditional Chinese (in Big5)
ru_ru: perltw Perl для традиционного китайского (в Big5)

source: perlunicode Perl Unicode support
ru_ru: perlunicode Perl поддержка юникода

source: perluniintro Perl Unicode introduction
ru_ru: perluniintro Perl введение в Unicode

source: perluniprops Index of Unicode properties in Perl
ru_ru: perluniprops Каталог свойств Unicode в Perl

source: perlunitut Perl Unicode tutorial
ru_ru: perlunitut Perl Unicode учебник

source: perlutil utilities packaged with the Perl distribution
ru_ru: perlutil утилиты, идущие в комплекте с поставкой Perl

source: perlvar Perl predefined variables
ru_ru: perlvar Perl предопределенные переменные

source: perlvms Perl notes for VMS
ru_ru: perlvms Perl заметки для VMS

source: perlvos Perl notes for Stratus VOS
ru_ru: perlvos Perl заметки для Stratus VOS
